---
type: FlexDuct
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 8
tags: [revit-api, class]
---

# FlexDuct

`Autodesk.Revit.DB.Mechanical.FlexDuct` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | IsFlexDuctTypeId | 2014 | `public static bool IsFlexDuctTypeId ( Document document , ElementId ductTypeId )` |
| Method | IsHVACSystemTypeId | 2014 | `public static bool IsHVACSystemTypeId ( Document document , ElementId systemTypeId )` |
| Property | EndTangent | 2014 | `public XYZ EndTangent { get ; set ; }` |
| Property | FlexDuctType | — | `public FlexDuctType FlexDuctType { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Points | — | `public IList < XYZ > Points { get ; set ; }` |
| Property | StartTangent | 2014 | `public XYZ StartTangent { get ; set ; }` |